Revit 2027 API
MacroManager.GetMacroManager Method
 Gets the Macro manager from the application.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MacroManager GetMacroManager(
	Application application
)
Public Shared Function GetMacroManager (
	application As Application
) As MacroManager
public:
static MacroManager^ GetMacroManager(
	Application^ application
)
static member GetMacroManager :
        application : Application -> MacroManager
Parameters
application Application
 The application.
Return Value
MacroManager
 The new Macro manager object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace